In [1]:
import seaborn as sns
import pandas as pd
import requests

In [4]:
# Load the Titanic dataset from Seaborn
titanic = sns.load_dataset('titanic')

titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [1]:
# Drop irrelevant columns for simplicity
titanic = titanic[['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'survived']].dropna()

# Convert categorical columns to numeric
titanic['sex'] = titanic['sex'].map({'male': 0, 'female': 1})
titanic['embarked'] = titanic['embarked'].map({'C': 0, 'Q': 1, 'S': 2})

# Define the features and target
X = titanic.drop('survived', axis=1)
y = titanic['survived']

Matplotlib is building the font cache; this may take a moment.

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
import pickle

# Split the dataset into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Train a RandomForestClassifier
clf = RandomForestClassifier()
clf.fit(X_train, y_train)

In [ ]:
# Save the trained model
with open('titanic_model.pkl', 'wb') as model_file:
    pickle.dump(clf, model_file)

Run the flask_model.py file to get resposes from the deployed model.

In [8]:
# Sample data for testing
data = {
    'data': [3, 0, 22, 1, 0, 7.25, 2]
}

response = requests.post('http://localhost:5000/predict', json=data)
print(response.json())

{'prediction': 0}